Revit 2026 API

# SolidOrShellTessellationControls Class

---

Controls various aspects of the triangulation produced by [!:SolidUtils::tessellateSolidOrShell()] method.

SystemObject Autodesk.Revit.DBSolidOrShellTessellationControls

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SolidOrShellTessellationControls : IDisposable
```
```vb
Public Class SolidOrShellTessellationControls
	Implements IDisposable
```
```cpp
public ref class SolidOrShellTessellationControls : IDisposable
```
```fsharp
type SolidOrShellTessellationControls =
    class
        interface IDisposable
    end
```

The SolidOrShellTessellationControls type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SolidOrShellTessellationControls | Default constructor. |

|  | Name | Description |
| --- | --- | --- |
|  | Accuracy | A positive real number specifying how accurately a triangulation should approximate a solid or shell. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LevelOfDetail | An number between 0 and 1 (inclusive) specifying the level of detail for the triangulation of a solid or shell. |
|  | MinAngleInTriangle | A non-negative real number specifying the minimum allowed angle for any triangle in the triangulation, in radians. |
|  | MinExternalAngleBetweenTriangles | A positive real number specifying the minimum allowed value for the external angle between two adjacent triangles, in radians. |

|  | Name | Description |
| --- | --- | --- |
|  | DisableLevelOfDetail | Disables the use of levelOfDetail. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input). |
|  | Dispose | Releases all resources used by the SolidOrShellTessellationControls |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | UseLevelOfDetail | Returns true if the use of levelOfDetail is enabled, false if not. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input). |

#### Reference

Autodesk.Revit.DB Namespace